request_sample_CarService.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:ser="http://service.wssoap.spring.org/">
   <soapenv:Header>
	  <wsse:Security soapenv:mustUnderstand="1" xmlns:wsse="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-secext-1.0.xsd" xmlns:wsu="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-utility-1.0.xsd">
         <wsse:UsernameToken wsu:Id="UsernameToken-F434D320D890F7CF1715251639631263">
            <wsse:Username>myuser</wsse:Username>
            <wsse:Password Type="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-username-token-profile-1.0#PasswordText">mypassword</wsse:Password>
         </wsse:UsernameToken>
      </wsse:Security>
	</soapenv:Header>
   <soapenv:Body>
      <ser:getPrice>
         <!--Optional:-->
         <CarRequest>
            <id>56</id>
            <!--Optional:-->
            <brand>BMW</brand>
            <year>1990</year>
         </CarRequest>
      </ser:getPrice>
   </soapenv:Body>
</soapenv:Envelope>